{
    "meta": {
      "theme": "elegant"
    },
    "basics": {
      "name": "Murali Ramu",
      "label": "Senior Applications Engineer",
      "image": "",
      "summary": "I'm an applications engineer holding a master's in integrated circuits and systems and a bachelor's in electronics and communication engineering. I've primarily worked as a Customer Applications Engineer with experience in supporting Wi-Fi equipment from the Infineon/Cypress line-up. I'm eager to investigate fresh opportunities and responsibilities in design, applications, and firmware development. I'm willing to engage in discussions and consider positions that might not fit into the few categories I've listed.",
      "website": "https://mirutech.dev",
      "email": "muralir021998@gmail.com",
      "location": {
        "city": "Bengaluru",
        "countryCode": "IN"
      },
      "profiles": [
        {
          "username": "murali_ramu_",
          "url": "https://twitter.com/murali_ramu_",
          "network": "twitter"
        },
        {
          "url": "https://github.com/mirutech2",
          "username": "mirutech2",
          "network": "github"
        },
        {
          "url": "https://www.linkedin.com/in/murali-ramu-b272a1167/",
          "username": "Murali Ramu",
          "network": "linkedin"
        }
      ]
    },
    "education": [
      {
        "endDate": "2023-07-22",
        "startDate": "2020-09-01",
        "area": "Integrated Circuits and Systems",
        "studyType": "Masters",
        "institution": "IIT-Madras"
      },
      {
        "endDate": "2019-05-31",
        "startDate": "2015-08-01",
        "area": "Electronics and Communications Engineering",
        "studyType": "Bachelors",
        "institution": "SJCE, Mysuru"
      }
    ],
    "references": [
      {
        "reference": "Thomas was hired as a lead developer and, upon the leaving of our co-founder took over as CTO of Earbits. Thomas is, hands down, one of those A Players you hear of companies dying to hire. He is incredibly smart, not just at code but about everything from classical music to Chinese language and culture. Thomas is great to work with and, as a well established contributor to open source projects and several successful ventures, commands the respect of engineers at all levels. I would suggest doing anything you can to have him on your team.",
        "name": "Joey Flores, Co-founder and CEO of Earbits, Inc."
      },
      {
        "reference": "I've had the great pleasure of working with Thomas for the past three years at Earbits, and on a few side projects. Two years ago our CTO left on a moment's notice, Thomas saved our company by quickly stepping up to fill this role. He has been with our company through thick and thin and made serious personal sacrifices in order to help the company during tough times. He is a phenomenal hacker and a true team player. Highly recommended!",
        "name": "Yotam Rosenbaum, SVP of Operations, Earbits, Inc."
      },
      {
        "reference": "Thomas is an extremely talented engineer with a very broad range of skills and experience. From being a thought leader in the front-end community via backbonetutorials.com and cdnjs.com, to designing and implementing the API for cdnjs.com, working with Thomas has been fantastic learning experience. Thomas is truly a full stack develop, and his work output is incredible. If there is any opportunity to work with Thomas, I take it. He is the definition of an A player.",
        "name": "Ryan Kirkman, Senior Software Engineer at Nerdwallet"
      },
      {
        "reference": "On Thomas Davis... Hire this guy. Do not be fooled. Incredibly capable and fast. Plays well with others. Unbelievable at front-end work end programming but that is just the start. Visionary. Hire him before I do.",
        "name": "Greg Davis"
      }
    ],
    "skills": [
      {
        "keywords": [
          "C",
          "Embedded C",
          "Verilog",
          "Python"
        ],
        "level": "Senior",
        "name": "Programming Skills"
      },
      {
        "keywords": [
          "Analog/Digital Design", 
          "Assembly", 
          "Soldering/Etching PCB's", 
          "Schematic/Layout reviews"
        ],
        "level": "Senior",
        "name": "Hardware Skills"
      }
    ],
    "awards": [
      {
        "title": "Defender of the Internet",
        "awarder": "Fight For The Future"
      }
    ],
    "work": [
      {
        "summary": "Tokenized is a Bitcoin wallet for issuing, managing and trading digital tokens. I built out the front end which was packaged as an electron app. It was a difficult frontend to build because we store the users keys locally and used them to sign transactions and contracts.",
        "website": "https://tokenized.com/",
        "name": "Tokenized",
        "location": "Melbourne",
        "position": "Senior Javascript Developer",
        "startDate": "2020-05-05",
        "highlights": ["React", "Redux", "SCSS", "Product"]
      },
      {
        "summary": "Blockbid is an Australian crypto currency exchange. I started off on the frontend but eventually became lead tech and worked on every moving piece of the exchange. I really enjoyed working with liquidity providers and connecting their platforms to help us achieve liquid markets.",
        "website": "https://platform.blockbid.io",
        "name": "Blockbid",
        "location": "Melbourne",
        "position": "Senior Javascript Developer",
        "startDate": "2018-03-01",
        "endDate": "2020-01-01",
        "highlights": [
          "React, Apollo, Styled Components",
          "Node.js / Rails",
          "Docker / Heroku / GCP",
          "Used Figma for design and UX work",
          "Optimizing markets with tens of millions of rows using SQL."
        ]
      }
    ],
    "interests": [
      {
        "keywords": [
          "Swimming",
          "Badminton"
        ],
        "name": "Physical Activities"
      },
      {
        "keywords": [
          "Current Affairs",
          "Geo-Polictics",
          "History",
          "Mythology"
        ],
        "name": "Podcasts/Audio Books"
      },
      {
        "keywords": [
          "Action",
          "Adventure",
          "Comedy",
          "Romance",
          "Sci-Fi"
        ],
        "name": "Movies"
      }
    ]
  }